
<!DOCTYPE HTML>
<html lang="zh-cn,en" >
    <head>
        <title>网络操作 · Shell 编程范例</title>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.1.1">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="01-chapter9.html" />
    
    
    <link rel="prev" href="01-chapter7.html" />
    

    <!-- tester360.cn Baidu tongji analytics -->
<script>
var _hmt = _hmt || [];
(function() {
var hm = document.createElement("script");
hm.src = "//hm.baidu.com/hm.js?7d789811683659f2ce2723c13b6f88ef";
var s = document.getElementsByTagName("script")[0];
s.parentNode.insertBefore(hm, s);
})();
</script>
</head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="http://www.tester360.cn" target="_blank" class="custom-link">首页</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../preface/01-chapter0.html">
            
                <a href="../preface/01-chapter0.html">
            
                    
                    版本修订历史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../preface/01-chapter1.html">
            
                <a href="../preface/01-chapter1.html">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="01-chapter1.html">
            
                <a href="01-chapter1.html">
            
                    
                    准备工作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="01-chapter2.html">
            
                <a href="01-chapter2.html">
            
                    
                    数值运算
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="01-chapter3.html">
            
                <a href="01-chapter3.html">
            
                    
                    布尔运算
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="01-chapter4.html">
            
                <a href="01-chapter4.html">
            
                    
                    字符串操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="01-chapter5.html">
            
                <a href="01-chapter5.html">
            
                    
                    文件操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="01-chapter6.html">
            
                <a href="01-chapter6.html">
            
                    
                    文件系统操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="01-chapter7.html">
            
                <a href="01-chapter7.html">
            
                    
                    进程操作
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.11" data-path="01-chapter8.html">
            
                <a href="01-chapter8.html">
            
                    
                    网络操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="01-chapter9.html">
            
                <a href="01-chapter9.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="../appendix/02-chapter1.html">
            
                <a href="../appendix/02-chapter1.html">
            
                    
                    附录
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >网络操作</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7F51;&#x7EDC;&#x64CD;&#x4F5C;">&#x7F51;&#x7EDC;&#x64CD;&#x4F5C;</h1>
<ul>
<li><a href="#toc_5782_1744_1">&#x524D;&#x8A00;</a></li>
<li><a href="#toc_5782_1744_2">&#x7F51;&#x7EDC;&#x539F;&#x7406;&#x4ECB;&#x7ECD;</a><ul>
<li><a href="#toc_5782_1744_3">&#x6211;&#x4EEC;&#x7684;&#x7F51;&#x7EDC;&#x4E16;&#x754C;</a></li>
<li><a href="#toc_5782_1744_4">&#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x548C;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x4ECB;&#x7ECD;</a></li>
</ul>
</li>
<li><a href="#toc_5782_1744_5">Linux &#x4E0B;&#x7F51;&#x7EDC;&#x201C;&#x5B9E;&#x6218;&#x201D;</a><ul>
<li><a href="#toc_5782_1744_6">&#x5982;&#x4F55;&#x628A;&#x6211;&#x4EEC;&#x7684; Linux &#x4E3B;&#x673A;&#x63A5;&#x5165;&#x7F51;&#x7EDC;</a><ul>
<li><a href="#toc_5782_1744_7">&#x8303;&#x4F8B;&#xFF1A;&#x901A;&#x8FC7;dhclient&#x83B7;&#x53D6;IP&#x5730;&#x5740;</a></li>
<li><a href="#toc_5782_1744_8">&#x8303;&#x4F8B;&#xFF1A;&#x9759;&#x6001;&#x914D;&#x7F6E;IP&#x5730;&#x5740;</a></li>
</ul>
</li>
<li><a href="#toc_5782_1744_9">&#x7528; Linux &#x642D;&#x5EFA;&#x7F51;&#x6865;</a></li>
<li><a href="#toc_5782_1744_10">&#x7528; Linux &#x505A;&#x8DEF;&#x7531;</a></li>
<li><a href="#toc_5782_1744_11">&#x7528; Linux &#x642D;&#x5EFA;&#x5404;&#x79CD;&#x5E38;&#x89C4;&#x7684;&#x7F51;&#x7EDC;&#x670D;&#x52A1;</a></li>
<li><a href="#toc_5782_1744_12">Linux &#x4E0B;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x8BCA;&#x65AD;&#x4E0E;&#x7EF4;&#x62A4;</a></li>
</ul>
</li>
<li><a href="#toc_5782_1744_13">Linux &#x4E0B;&#x7F51;&#x7EDC;&#x7F16;&#x7A0B;&#x4E0E;&#x5F00;&#x53D1;</a></li>
<li><a href="#toc_5782_1744_14">&#x540E;&#x8BB0;</a></li>
<li><a href="#toc_5782_1744_15">&#x53C2;&#x8003;&#x8D44;&#x6599;</a></li>
</ul>
<p><span id="toc_5782_1744_1"></span></p>
<h2 id="&#x524D;&#x8A00;">&#x524D;&#x8A00;</h2>
<p>&#x524D;&#x9762;&#x7AE0;&#x8282;&#x5DF2;&#x7ECF;&#x4ECB;&#x7ECD;&#x4E86;Shell&#x7F16;&#x7A0B;&#x8303;&#x4F8B;&#x4E4B;&#x6570;&#x503C;&#x3001;&#x5E03;&#x5C14;&#x503C;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x3001;&#x6587;&#x4EF6;&#x3001;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3001;&#x8FDB;&#x7A0B;&#x7B49;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x57FA;&#x672C;&#x8986;&#x76D6;&#x4E86;&#x7F51;&#x7EDC;&#x4E2D;&#x67D0;&#x4E2A;&#x72EC;&#x7ACB;&#x673A;&#x5668;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x7684;&#x201C;&#x65B9;&#x65B9;&#x9762;&#x9762;&#x201D;&#xFF0C;&#x73B0;&#x5728;&#x9700;&#x8981;&#x628A;&#x89C6;&#x89D2;&#x4ECE;&#x5355;&#x4E00;&#x7684;&#x673A;&#x5668;&#x5EF6;&#x4F38;&#x5230;&#x8FD9;&#x4E9B;&#x673A;&#x5668;&#x901A;&#x8FC7;&#x5404;&#x79CD;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x548C;&#x534F;&#x8BAE;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x7684;&#x7F51;&#x7EDC;&#x4E16;&#x754C;&#xFF0C;&#x5206;&#x6790;&#x7F51;&#x7EDC;&#x62D3;&#x6251;&#x7ED3;&#x6784;&#x3001;&#x7F51;&#x7EDC;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x3001;&#x4E86;&#x89E3;&#x5404;&#x79CD;&#x5E38;&#x89C1;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x3001;&#x5404;&#x79CD;&#x5E38;&#x89C1;&#x786C;&#x4EF6;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x3001;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x4E0E;&#x5B89;&#x5168;&#x76F8;&#x5173;&#x8F6F;&#x4EF6;&#x4EE5;&#x53CA;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x5206;&#x6790;&#x7B49;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x56E0;&#x4E3A;&#x7F51;&#x7EDC;&#x76F8;&#x5173;&#x7684;&#x95EE;&#x9898;&#x786E;&#x5B9E;&#x592A;&#x590D;&#x6742;&#x4E86;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x53EF;&#x80FD;&#x4ECB;&#x7ECD;&#x5177;&#x4F53;&#xFF0C;&#x56E0;&#x6B64;&#x5982;&#x679C;&#x60F3;&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#xFF0C;&#x8FD8;&#x662F;&#x5EFA;&#x8BAE;&#x53C2;&#x8003;&#x76F8;&#x5173;&#x8D44;&#x6599;&#x3002;&#x4F46;Linux&#x662F;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x539F;&#x7406;&#x5B66;&#x4E60;&#x548C;&#x5B9E;&#x8DF5;&#x7684;&#x597D;&#x5E73;&#x53F0;&#xFF0C;&#x4E0D;&#x4EC5;&#x56E0;&#x4E3A;&#x5B83;&#x672C;&#x8EAB;&#x5BF9;&#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x5B9E;&#x73B0;&#x662F;&#x5F00;&#x653E;&#x6E90;&#x4EE3;&#x7801;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x5404;&#x79CD;&#x76F8;&#x5173;&#x7684;&#x5206;&#x6790;&#x5DE5;&#x5177;&#x548C;&#x51FD;&#x6570;&#x5E93;&#x6570;&#x4E0D;&#x80DC;&#x6570;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x662F;&#x5B66;&#x751F;&#xFF0C;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x9519;&#x8FC7;&#x901A;&#x8FC7;&#x5B83;&#x6765;&#x505A;&#x76F8;&#x5173;&#x7684;&#x5B9E;&#x8DF5;&#x5DE5;&#x4F5C;&#x3002;</p>
<p><span id="toc_5782_1744_2"></span></p>
<h2 id="&#x7F51;&#x7EDC;&#x539F;&#x7406;&#x4ECB;&#x7ECD;">&#x7F51;&#x7EDC;&#x539F;&#x7406;&#x4ECB;&#x7ECD;</h2>
<p><span id="toc_5782_1744_3"></span></p>
<h3 id="&#x6211;&#x4EEC;&#x7684;&#x7F51;&#x7EDC;&#x4E16;&#x754C;">&#x6211;&#x4EEC;&#x7684;&#x7F51;&#x7EDC;&#x4E16;&#x754C;</h3>
<p>&#x5728;&#x8FDB;&#x884C;&#x6240;&#x6709;&#x4ECB;&#x7ECD;&#x4E4B;&#x524D;&#xFF0C;&#x6765;&#x76F4;&#x89C2;&#x5730;&#x611F;&#x53D7;&#x4E00;&#x4E0B;&#x90A3;&#x4E2A;&#x771F;&#x771F;&#x5B9E;&#x5B9E;&#x5B58;&#x5728;&#x7684;&#x7F51;&#x7EDC;&#x4E16;&#x754C;&#x5427;&#x3002;&#x5F53;&#x6211;&#x5728; Linux &#x4E0B;&#x901A;&#x8FC7; <code>Web</code> &#x7F16;&#x8F91;&#x5668;&#x5199;&#x8FD9;&#x7BC7; Blog &#x65F6;&#xFF0C;&#x4E00;&#x8FB9;&#x7528; <code>mplayer</code> &#x542C;&#x7740;&#x8FDC;&#x7A0B;&#x97F3;&#x4E50;&#xFF0C;&#x7D2F;&#x4E86;&#x65F6;&#x5219;&#x6253;&#x5F00;&#x5170;&#x5927;&#x7684;&#x7F51;&#x7EDC; <code>TV</code> &#x9891;&#x9053;&#x5F00;&#x59CB;&#x770B;&#x770B;&#x51E4;&#x51F0;&#x536B;&#x89C6;&#x2026;&#x2026;&#x8FD9;&#x4E9B;&#x201C;&#x73B0;&#x4EE3;&#x5316;&#x201D;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x6211;&#x60F3;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x7F51;&#x7EDC;&#xFF0C;&#x5C06;&#x53D8;&#x5F97;&#x65E0;&#x6CD5;&#x60F3;&#x8C61;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x6765;&#x6784;&#x60F3;&#x4E00;&#x4E0B;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x4E16;&#x754C;&#x7684;&#x4F18;&#x7F8E;&#x56FE;&#x753B;&#xFF1A;</p>
<blockquote>
<p>&#x4E00;&#x8FB9;&#x76EF;&#x7740;&#x663E;&#x793A;&#x5668;&#xFF0C;&#x4E00;&#x8FB9;&#x6572;&#x51FB;&#x7740;&#x952E;&#x76D8;&#xFF0C;&#x4E00;&#x8FB9;&#x6302;&#x7740;&#x8033;&#x673A;&#x3002;</p>
<p>&#x4E3B;&#x673A;&#x7535;&#x6E90;&#x706F;&#x707F;&#x70C2;&#x5F97;&#x5F88;&#xFF0C;&#x53D1;&#x7740;&#x7EFF;&#x5149;&#xFF0C;&#x8FD9;&#x65F6;&#x5F88;&#x5BB9;&#x6613;&#x60F3;&#x8C61;&#x4E3B;&#x673A;&#x80CC;&#x540E;&#x7684;&#x90A3;&#x4E2A;&#x7F51;&#x5361;&#x4F4D;&#x7F6E;&#x80AF;&#x5B9A;&#x6709;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x989C;&#x8272;&#x7684;&#x706F;&#x5149;&#x5728;&#x95EA;&#x70C1;&#xFF0C;&#x5B83;&#x663E;&#x793A;&#x7740;&#x4E3B;&#x673A;&#x6B63;&#x5728;&#x4E0E;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x4E16;&#x754C;&#x6253;&#x7740;&#x4EA4;&#x9053;&#x3002;</p>
<p>&#x5C31;&#x5728;&#x5B9E;&#x9A8C;&#x5BA4;&#x7684;&#x67D0;&#x4E2A;&#x89D2;&#x843D;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x4EA4;&#x6362;&#x673A;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x7F51;&#x53E3;&#x7684;&#x7F51;&#x7EBF;&#x8FDE;&#x5230;&#x4E3B;&#x673A;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EA4;&#x6362;&#x673A;&#x63A5;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x5C40;&#x57DF;&#x7F51;&#x7684;&#x7F51;&#x5173;&#x4E0A;&#xFF0C;&#x7136;&#x540E;&#x8FD9;&#x4E2A;&#x7F51;&#x5173;&#x518D;&#x63A5;&#x5230;&#x4E86;&#x4FE1;&#x606F;&#x697C;&#x7684;&#x67D0;&#x4E2A;&#x8DEF;&#x7531;&#x5668;&#x4E0A;&#xFF0C;&#x518D;&#x8F6C;&#x63A5;&#x5230;&#x5B66;&#x6821;&#x7F51;&#x7EDC;&#x4E2D;&#x5FC3;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x8DEF;&#x7531;&#x5668;&#x4E0A;&#x2026;&#x2026;</p>
<p>&#x671F;&#x95F4;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x8DEF;&#x7531;&#x5668;&#x8FDE;&#x63A5;&#x5230;&#x4E86;&#x8FD9;&#x4E2A; Blog &#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x800C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5219;&#x53EF;&#x80FD;&#x8FDE;&#x5230;&#x4E86;&#x90A3;&#x4E2A;&#x7F51;&#x7EDC; <code>TV</code> &#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x8FD8;&#x6709;&#x5462;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x5219;&#x8FDE;&#x63A5;&#x5230;&#x4E86;&#x7535;&#x4FE1;&#x7F51;&#x7EDC;&#x91CC;&#x5934;&#x7684;&#x67D0;&#x4E2A;&#x97F3;&#x4E50;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x2026;&#x2026;</p>
</blockquote>
<p>&#x4E0B;&#x9762;&#x7528; <code>dia</code> &#x7ED8;&#x5236;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x201C;&#x7F51;&#x7EDC;&#x5730;&#x56FE;&#x201D;&#xFF1A;</p>
<p><img src="pic/Network_Architecture.jpg" alt="Network Architecture"></p>
<p>&#x8BE5;&#x56FE;&#x628A;&#x4E00;&#x4E9B;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x548C;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x57FA;&#x672C;&#x90FD;&#x5448;&#x73B0;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x5305;&#x62EC;&#x672C;&#x5730;&#x4E3B;&#x673A;&#x3001;&#x8DEF;&#x7531;&#x3001;&#x4EA4;&#x6362;&#x673A;&#x3001;&#x7F51;&#x6865;&#xFF0C;&#x57DF;&#x540D;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4E07;&#x7EF4;&#x7F51;&#x670D;&#x52A1;&#xFF0C;&#x89C6;&#x9891;&#x670D;&#x52A1;&#xFF0C;&#x9632;&#x706B;&#x5899;&#x670D;&#x52A1;&#xFF0C;&#x52A8;&#x6001; <code>IP</code> &#x5730;&#x5740;&#x670D;&#x52A1;&#x7B49;&#x3002;&#x5176;&#x4E2D;&#x5404;&#x79CD;&#x8BBE;&#x5907;&#x6784;&#x6210;&#x4E86;&#x6574;&#x4E2A;&#x7269;&#x7406;&#x7F51;&#x7EDC;&#xFF0C;&#x800C;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x5219;&#x662F;&#x6784;&#x5EFA;&#x5728;&#x8FD9;&#x4E9B;&#x8BBE;&#x5907;&#x4E0A;&#x7684;&#x5404;&#x79CD;&#x7F51;&#x7EDC;&#x5E94;&#x7528;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x7684;&#x7F51;&#x7EDC;&#x5E94;&#x7528;&#x8D8A;&#x6765;&#x8D8A;&#x4E30;&#x5BCC;&#x591A;&#x6837;&#xFF0C;&#x6BD4;&#x5982;&#x5373;&#x65F6;&#x804A;&#x5929;&#xFF08;<code>IM</code>&#xFF09;&#x3001; <code>p2p</code> &#x8D44;&#x6E90;&#x5171;&#x4EAB;&#x3001;&#x7F51;&#x7EDC;&#x641C;&#x7D22;&#x7B49;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x5728;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x4E4B;&#x4E0A;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x5B89;&#x5168;&#x6709;&#x6548;&#x7684;&#x5DE5;&#x4F5C;&#x5462;&#xFF1F;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x8FD9;&#x80CC;&#x540E;&#x9010;&#x6B65;&#x5B8C;&#x5584;&#x7684;&#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x548C;&#x5404;&#x79CD;&#x76F8;&#x5173;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x7684;&#x5F00;&#x53D1;&#x3001;&#x5B9E;&#x73B0;&#x548C;&#x5E94;&#x7528;&#x3002;</p>
<p><span id="toc_5782_1744_4"></span></p>
<h3 id="&#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x548C;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x4ECB;&#x7ECD;">&#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x548C;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x4ECB;&#x7ECD;</h3>
<p>&#x90A3;&#x4E48;&#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x662F;&#x600E;&#x4E48;&#x6837;&#x7684;&#x5462;&#xFF1F;&#x6D89;&#x53CA;&#x5230;&#x54EA;&#x4E9B;&#x76F8;&#x5173;&#x7684;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x5462;&#xFF1F;&#x4EC0;&#x4E48;&#x53C8;&#x662F;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x5462;&#xFF1F;</p>
<p>&#x5728;&#x300A;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x2014;&#x2014;&#x81EA;&#x9876;&#x5411;&#x4E0B;&#x7684;&#x65B9;&#x6CD5;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x975E;&#x5E38;&#x5DE7;&#x5999;&#x5730;&#x7ED9;&#x51FA;&#x4E86;&#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x5206;&#x5C42;&#x7684;&#x6BD4;&#x55BB;&#xFF0C;&#x628A;&#x7F51;&#x7EDC;&#x4E2D;&#x5404;&#x5C42;&#x8DDF;&#x4EA4;&#x901A;&#x8FD0;&#x8F93;&#x4F53;&#x7CFB;&#x4E2D;&#x7684;&#x5404;&#x4E2A;&#x73AF;&#x8282;&#x5BF9;&#x7167;&#x8D77;&#x6765;&#xFF0C;&#x8BA9;&#x4EBA;&#x901A;&#x4FD7;&#x6613;&#x61C2;&#x3002;&#x5728;&#x4EA4;&#x901A;&#x8FD0;&#x8F93;&#x4F53;&#x7CFB;&#x4E2D;&#xFF0C;&#x8FD0;&#x8F93;&#x7684;&#x662F;&#x4EBA;&#x548C;&#x7269;&#x54C1;&#xFF0C;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x4E2D;&#xFF0C;&#x8FD0;&#x8F93;&#x7684;&#x662F;&#x7535;&#x5B50;&#x6570;&#x636E;&#x3002;&#x8003;&#x8651;&#x5230;&#x4EA4;&#x901A;&#x8FD0;&#x8F93;&#x7F51;&#x7EDC;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x4E2D;&#x6700;&#x7EC8;&#x90FD;&#x53EF;&#x4EE5;&#x5212;&#x5F52;&#x4E3A;&#x70B9;&#x5BF9;&#x70B9;&#x7684;&#x4FE1;&#x606F;&#x4F20;&#x8F93;&#x3002;&#x8FD9;&#x91CC;&#x8003;&#x8651;&#x4E24;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x4FE1;&#x606F;&#x4F20;&#x9012;&#x8FC7;&#x7A0B;&#xFF0C;&#x5F97;&#x5230;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5BF9;&#x7167;&#x5173;&#x7CFB;&#xFF0C;&#x89C1;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img src="pic/Network_Layer_Compare.jpg" alt="Network Layer&#x4E0E;&#x4EA4;&#x901A;&#x8FD0;&#x8F93;&#x4F53;&#x7CFB;&#x6BD4;&#x8F83;"></p>
<p>&#x5BF9;&#x7167;&#x4E0A;&#x56FE;&#xFF0C;&#x66F4;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x53F3;&#x4FA7;&#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x5206;&#x5C42;&#x539F;&#x7406;&#xFF08;&#x5982;&#x679C;&#x6BD4;&#x7167;&#x4E00;&#x5C01;&#x4FE1;&#x53D1;&#x51FA;&#x5230;&#x6536;&#x5230;&#x7684;&#x8FD9;&#x4E00;&#x4E2D;&#x95F4;&#x8FC7;&#x7A0B;&#x53EF;&#x80FD;&#x66F4;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#xFF09;&#xFF0C;&#x4E0A;&#x56FE;&#x53F3;&#x4FA7;&#x662F; <code>TCP/IP</code> &#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x5206;&#x5C42;&#x793A;&#x610F;&#x56FE;&#xFF0C;&#x5728;&#x628A;&#x6570;&#x636E;&#x53D1;&#x9001;&#x5230;&#x7F51;&#x7EDC;&#x4E4B;&#x524D;&#xFF0C;&#x5728;&#x5404;&#x5C42;&#x4E2D;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5404;&#x79CD;&#x201C;&#x6253;&#x5305;&#x201D;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x4ECE;&#x7F51;&#x7EDC;&#x63A5;&#x6536;&#x5230;&#x6570;&#x636E;&#x540E;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x201C;&#x89E3;&#x5305;&#x201D;&#x64CD;&#x4F5C;&#xFF0C;&#x6700;&#x7EC8;&#x628A;&#x7EAF;&#x7CB9;&#x7684;&#x6570;&#x636E;&#x4FE1;&#x606F;&#x7ED9;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x79CD;&#x5206;&#x5C42;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x4E3A;&#x4E86;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x7684;&#x9700;&#x8981;&#xFF0C;&#x4E5F;&#x662F;&#x4E24;&#x4E2A;&#x4E3B;&#x673A;&#x4E4B;&#x95F4;&#x5982;&#x4F55;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x548C;&#x53EF;&#x9760;&#x6027;&#x7684;&#x9700;&#x8981;&#x3002;&#x901A;&#x8FC7;&#x628A;&#x5404;&#x79CD;&#x9700;&#x8981;&#x5206;&#x6563;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5C42;&#x6B21;&#xFF0C;&#x4F7F;&#x5F97;&#x6574;&#x4E2A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x66F4;&#x52A0;&#x6E05;&#x6670;&#x548C;&#x660E;&#x4E86;&#x3002;&#x8FD9;&#x4E9B;&#x201C;&#x9700;&#x6C42;&#x201D;&#x5177;&#x4F53;&#x901A;&#x8FC7;&#x5404;&#x79CD;&#x5BF9;&#x5E94;&#x7684;&#x534F;&#x8BAE;&#x6765;&#x89C4;&#x8303;&#xFF0C;&#x8FD9;&#x4E9B;&#x89C4;&#x8303;&#x7EDF;&#x6210;&#x4E3A;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x3002;</p>
<p>&#x5173;&#x4E8E; <code>OSI</code> &#x6A21;&#x578B;&#xFF08;7 &#x5C42;&#xFF09;&#x6BD4;&#x7167; <code>TCP/IP</code> &#x6A21;&#x578B;&#xFF08;4 &#x5C42;&#xFF09;&#x7684;&#x534F;&#x8BAE;&#x6808;&#x53EF;&#x4EE5;&#x4ECE;&#x4E0B;&#x56FE;&#xFF08;&#x6765;&#x81EA;&#x7F51;&#x7EDC;&#xFF09;&#x770B;&#x4E2A;&#x660E;&#x4E86;&#xFF1A;</p>
<p><img src="pic/Network_Layer_OSI.jpg" alt="OSI Network Layer"></p>
<p>&#x800C;&#x4E0B;&#x56FE;&#xFF08;&#x6765;&#x81EA;&#x7F51;&#x7EDC;&#xFF09;&#x5219;&#x66F4;&#x6E05;&#x6670;&#x5730;&#x4F53;&#x73B0;&#x4E86; <code>TCP/IP</code> &#x5206;&#x5C42;&#x6A21;&#x578B;&#x3002;</p>
<p><img src="pic/Network_Layer_TCP_IP.jpg" alt="TCP IP Network Layer"></p>
<p>&#x4E0A;&#x9762;&#x4ECB;&#x7ECD;&#x4E86;&#x7F51;&#x7EDC;&#x539F;&#x7406;&#x65B9;&#x9762;&#x7684;&#x57FA;&#x672C;&#x5185;&#x5BB9;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x7F51;&#x7EDC;&#x539F;&#x7406;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5BF9;&#x7F51;&#x7EDC;&#x652F;&#x6301;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x9605;&#x8BFB;&#x540E;&#x9762;&#x7684;&#x53C2;&#x8003;&#x8D44;&#x6599;&#x3002;&#x4E0B;&#x9762;&#x5C06;&#x505A;&#x4E00;&#x4E9B;&#x5B9E;&#x8DF5;&#xFF0C;&#x5373;&#x5728; Linux &#x4E0B;&#x5982;&#x4F55;&#x8054;&#x7F51;&#xFF0C;&#x5982;&#x4F55;&#x7528; Linux &#x642D;&#x5EFA;&#x5404;&#x79CD;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x65B9;&#x9762;&#x7684;&#x8003;&#x91CF;&#x4EE5;&#x53CA;&#x57FA;&#x672C;&#x7684;&#x7F51;&#x7EDC;&#x7F16;&#x7A0B;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x4ECB;&#x7ECD;&#x3002;</p>
<p><span id="toc_5782_1744_5"></span></p>
<h2 id="linux-&#x4E0B;&#x7F51;&#x7EDC;&#x5B9E;&#x6218;">Linux &#x4E0B;&#x7F51;&#x7EDC;&#x201C;&#x5B9E;&#x6218;&#x201D;</h2>
<p><span id="toc_5782_1744_6"></span></p>
<h3 id="&#x5982;&#x4F55;&#x628A;&#x6211;&#x4EEC;&#x7684;-linux-&#x4E3B;&#x673A;&#x63A5;&#x5165;&#x7F51;&#x7EDC;">&#x5982;&#x4F55;&#x628A;&#x6211;&#x4EEC;&#x7684; Linux &#x4E3B;&#x673A;&#x63A5;&#x5165;&#x7F51;&#x7EDC;</h3>
<p>&#x5982;&#x679C;&#x8981;&#x8BA9;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x8054;&#x7F51;&#xFF0C;&#x9996;&#x5148;&#x5F53;&#x7136;&#x662F;&#x642D;&#x5EFA;&#x597D;&#x7269;&#x7406;&#x7F51;&#x7EDC;&#x4E86;&#x3002;&#x63A5;&#x5165;&#x7F51;&#x7EDC;&#x7684;&#x7269;&#x7406;&#x65B9;&#x5F0F;&#x8FD8;&#x662F;&#x86EE;&#x591A;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x76F4;&#x63A5;&#x7528;&#x7F51;&#x7EBF;&#x63A5;&#x5165;&#x4EE5;&#x592A;&#x7F51;&#xFF0C;&#x7528;&#x65E0;&#x7EBF;&#x7F51;&#x5361;&#x4E0A;&#x7F51;&#xFF0C;&#x7528; <code>ADSL</code> &#x62E8;&#x53F7;&#x4E0A;&#x7F51;&#x2026;&#x2026;</p>
<p>&#x5BF9;&#x4E8E;&#x7528;&#x4EE5;&#x592A;&#x7F51;&#x7F51;&#x5361;&#x63A5;&#x5165;&#x7F51;&#x7EDC;&#x7684;&#x5E38;&#x89C1;&#x65B9;&#x5F0F;&#xFF0C;&#x5728;&#x642D;&#x5EFA;&#x597D;&#x7269;&#x7406;&#x7F51;&#x7EDC;&#x5E76;&#x786E;&#x4FDD;&#x8FDE;&#x63A5;&#x6B63;&#x5E38;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x914D;&#x7F6E; <code>IP</code> &#x5730;&#x5740;&#x548C;&#x9ED8;&#x8BA4;&#x7F51;&#x5173;&#x6765;&#x63A5;&#x5165;&#x7F51;&#x7EDC;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x624B;&#x5DE5;&#x914D;&#x7F6E;&#x548C;&#x52A8;&#x6001;&#x83B7;&#x53D6;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x3002;</p>
<p><span id="toc_5782_1744_7"></span></p>
<h4 id="&#x8303;&#x4F8B;&#xFF1A;&#x901A;&#x8FC7;dhclient&#x83B7;&#x53D6;ip&#x5730;&#x5740;">&#x8303;&#x4F8B;&#xFF1A;&#x901A;&#x8FC7;dhclient&#x83B7;&#x53D6;IP&#x5730;&#x5740;</h4>
<p>&#x5982;&#x679C;&#x6240;&#x5728;&#x7684;&#x5C40;&#x57DF;&#x7F51;&#x6709; <code>DHCP</code> &#x670D;&#x52A1;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x83B7;&#x53D6;&#xFF0C;<code>N</code> &#x662F;&#x8BBE;&#x5907;&#x540D;&#x79F0;&#xFF0C;&#x5982;&#x679C;&#x53EA;&#x6709;&#x4E00;&#x5757;&#x7F51;&#x5361;&#xFF0C;&#x4E00;&#x822C;&#x662F; 0 &#x6216;&#x8005; 1 &#x3002;</p>
<pre><code>$ dhclient ethN
</code></pre><p><span id="toc_5782_1744_8"></span></p>
<h4 id="&#x8303;&#x4F8B;&#xFF1A;&#x9759;&#x6001;&#x914D;&#x7F6E;ip&#x5730;&#x5740;">&#x8303;&#x4F8B;&#xFF1A;&#x9759;&#x6001;&#x914D;&#x7F6E;IP&#x5730;&#x5740;</h4>
<p>&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x91C7;&#x7528;&#x9759;&#x6001;&#x914D;&#x7F6E;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;<code>ip_address</code> &#x662F;&#x672C;&#x5730;&#x4E3B;&#x673A;&#x7684; <code>IP</code> &#x5730;&#x5740;&#xFF0C;<code>gw_ip_address</code> &#x662F;&#x63A5;&#x5165;&#x7F51;&#x7EDC;&#x7684;&#x7F51;&#x5173;&#x7684; <code>IP</code> &#x5730;&#x5740;&#x3002;</p>
<pre><code>$ ifconfig eth0 ip_address on
$ route add deafult gw gw_ip_address
</code></pre><p>&#x5982;&#x679C;&#x4E0A;&#x9762;&#x4E0D;&#x5DE5;&#x4F5C;&#xFF0C;&#x8BB0;&#x5F97;&#x901A;&#x8FC7; <code>ifconfig/mii-tool/ethtool</code> &#x7B49;&#x5DE5;&#x5177;&#x68C0;&#x67E5;&#x7F51;&#x5361;&#x662F;&#x5426;&#x6709;&#x88AB;&#x9A71;&#x52A8;&#x8D77;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7; <code>lspci/dmesg</code> &#x7B49;&#x68C0;&#x67E5;&#x7F51;&#x5361;&#x7C7B;&#x578B;&#xFF08;&#x6216;&#x8005;&#x901A;&#x8FC7;&#x4E3B;&#x677F;&#x624B;&#x518C;&#x548C;&#x72EC;&#x7ACB;&#x7F51;&#x5361;&#x81EA;&#x5E26;&#x7684;&#x624B;&#x518C;&#x67E5;&#x770B;&#xFF09;&#xFF0C;&#x63A5;&#x7740;&#x5B89;&#x88C5;&#x6216;&#x8005;&#x7F16;&#x8BD1;&#x76F8;&#x5173;&#x9A71;&#x52A8;&#xFF0C;&#x6700;&#x540E;&#x628A;&#x9A71;&#x52A8;&#x901A;&#x8FC7; <code>insmod/modprobe</code> &#x7B49;&#x5DE5;&#x5177;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x6838;&#x4E2D;&#x3002;</p>
<p><span id="toc_5782_1744_9"></span></p>
<h3 id="&#x7528;-linux-&#x642D;&#x5EFA;&#x7F51;&#x6865;">&#x7528; Linux &#x642D;&#x5EFA;&#x7F51;&#x6865;</h3>
<p>&#x7F51;&#x6865;&#x5DE5;&#x4F5C;&#x5728; <code>OSI</code> &#x6A21;&#x578B;&#x7684;&#x7B2C;&#x4E8C;&#x5C42;&#xFF0C;&#x5373;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#xFF0C;&#x5B83;&#x53EA;&#x9700;&#x8981;&#x77E5;&#x9053;&#x76EE;&#x6807;&#x4E3B;&#x673A;&#x7684; <code>MAC</code> &#x5730;&#x5740;&#x5C31;&#x53EF;&#x4EE5;&#x5DE5;&#x4F5C;&#x3002; Linux &#x5185;&#x6838;&#x5728; <code>2.2</code> &#x5F00;&#x59CB;&#x5C31;&#x5DF2;&#x7ECF;&#x652F;&#x6301;&#x4E86;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x5177;&#x4F53;&#x600E;&#x4E48;&#x914D;&#x7F6E;&#x770B;&#x770B;&#x540E;&#x7EED;<a href="http://www.ibm.com/developerworks/cn/linux/kernel/l-netbr/index.html" target="_blank">&#x53C2;&#x8003;&#x8D44;&#x6599;</a>&#x5427;&#x3002;&#x5982;&#x679C;&#x8981;&#x628A; Linux &#x4E3B;&#x673A;&#x914D;&#x7F6E;&#x6210;&#x4E00;&#x4E2A;&#x7F51;&#x6865;&#xFF0C;&#x81F3;&#x5C11;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x7F51;&#x5361;&#x3002;</p>
<p>&#x7F51;&#x6865;&#x7684;&#x4F5C;&#x7528;&#x76F8;&#x5F53;&#x4E8E;&#x4E00;&#x6839;&#x7F51;&#x7EBF;&#xFF0C;&#x7528;&#x6237;&#x65E0;&#x987B;&#x5173;&#x5FC3;&#x91CC;&#x5934;&#x6709;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#xFF0C;&#x628A;&#x5B83;&#x7684;&#x4E24;&#x4E2A;&#x7F51;&#x53E3;&#x8FDE;&#x63A5;&#x5230;&#x4E24;&#x4E2A;&#x4E3B;&#x673A;&#x4E0A;&#x5C31;&#x53EF;&#x4EE5;&#x8BA9;&#x8FD9;&#x4E24;&#x4E2A;&#x4E3B;&#x673A;&#x652F;&#x6301;&#x76F8;&#x4E92;&#x901A;&#x4FE1;&#x3002;&#x4E0D;&#x8FC7;&#x5B83;&#x6BD4;&#x7F51;&#x7EBF;&#x66F4;&#x5389;&#x5BB3;&#xFF0C;&#x5982;&#x679C;&#x914D;&#x4E0A;&#x9632;&#x706B;&#x5899;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x9694;&#x79BB;&#x8FDE;&#x63A5;&#x5728;&#x5B83;&#x4E24;&#x7AEF;&#x7684;&#x7F51;&#x6BB5;&#xFF08;&#x6CE8;&#x610F;&#x8FD9;&#x91CC;&#x662F;&#x7F51;&#x7EDC;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x8BC6;&#x522B; <code>IP</code>&#xFF09;&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x7F51;&#x6865;&#x6709;&#x591A;&#x4E2A;&#x7F51;&#x53E3;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x590D;&#x6742;&#x7684;&#x4EA4;&#x6362;&#x673A;&#xFF0C;&#x800C;&#x5982;&#x679C;&#x6709;&#x6548;&#x7EC4;&#x5408;&#x591A;&#x4E2A;&#x7F51;&#x6865;&#xFF0C;&#x5219;&#x6709;&#x53EF;&#x80FD;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x53EF;&#x5B9E;&#x73B0;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x548C;&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x7684;&#x9632;&#x706B;&#x5899;&#x7CFB;&#x7EDF;&#x3002;</p>
<p><span id="toc_5782_1744_10"></span></p>
<h3 id="&#x7528;-linux-&#x505A;&#x8DEF;&#x7531;">&#x7528; Linux &#x505A;&#x8DEF;&#x7531;</h3>
<p>&#x8DEF;&#x7531;&#x5DE5;&#x4F5C;&#x5728; <code>OSI</code> &#x6A21;&#x578B;&#x7684;&#x7B2C;&#x4E09;&#x5C42;&#xFF0C;&#x5373;&#x7F51;&#x7EDC;&#x5C42;&#xFF0C;&#x901A;&#x8FC7; <code>router</code> &#x53EF;&#x4EE5;&#x914D;&#x7F6E; Linux &#x7684;&#x8DEF;&#x7531;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;Linux &#x4E0B;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x5DE5;&#x5177;&#x652F;&#x6301;&#x52A8;&#x6001;&#x8DEF;&#x7531;&#x7684;&#x3002;&#x76F8;&#x5173;&#x7684;&#x8D44;&#x6599;&#x5728;&#x7F51;&#x8DEF;&#x4E2D;&#x94FA;&#x5929;&#x76D6;&#x5730;&#xFF0C;&#x7531;&#x4E8E;&#x65F6;&#x95F4;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x505A;&#x4ECB;&#x7ECD;&#x3002;</p>
<p><span id="toc_5782_1744_11"></span></p>
<h3 id="&#x7528;-linux-&#x642D;&#x5EFA;&#x5404;&#x79CD;&#x5E38;&#x89C4;&#x7684;&#x7F51;&#x7EDC;&#x670D;&#x52A1;">&#x7528; Linux &#x642D;&#x5EFA;&#x5404;&#x79CD;&#x5E38;&#x89C4;&#x7684;&#x7F51;&#x7EDC;&#x670D;&#x52A1;</h3>
<p>&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x5462;&#xFF1F;</p>
<ul>
<li>&#x7ED9;&#x5C40;&#x57DF;&#x7F51;&#x5F04;&#x4E2A; <code>DHCP</code> &#x670D;&#x52A1;&#x5668;&#xFF0C;&#x90A3;&#x5C31;&#x5F04;&#x4E2A; <code>dhcpd</code>&#xFF0C;&#x770B;&#x770B;<a href="http://tldp.org/HOWTO/DHCP/" target="_blank">&#x53C2;&#x8003;&#x8D44;&#x6599;</a>&#xFF1B;</li>
<li>&#x5982;&#x679C;&#x60F3;&#x5F04;&#x4E2A;&#x90AE;&#x4EF6;&#x53D1;&#x9001;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x90A3;&#x5C31;&#x5B89;&#x88C5;&#x4E2A; <code>sendmail</code> &#x6216;&#x8005; <code>exim4</code> &#xFF1B;</li>
<li>&#x5982;&#x679C;&#x518D;&#x60F3;&#x5F04;&#x4E2A;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x670D;&#x52A1;&#x5668;&#x5462;&#xFF0C;&#x90A3;&#x5C31;&#x88C5;&#x4E2A; <code>mailman</code> &#xFF1B;</li>
<li>&#x5982;&#x679C;&#x60F3;&#x5F04;&#x4E2A;&#x63A5;&#x6536;&#x90AE;&#x4EF6;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5462;&#xFF0C;&#x90A3;&#x5C31;&#x5B89;&#x88C5;&#x4E2A; <code>pop3</code> &#x670D;&#x52A1;&#x5668;&#xFF1B;</li>
<li>&#x5982;&#x679C;&#x60F3;&#x5F04;&#x4E2A; <code>web</code> &#x7AD9;&#x70B9;&#xFF0C;&#x90A3;&#x5C31;&#x5F04;&#x4E2A; <code>apache</code> &#x6216;&#x8005; <code>nginx</code> &#x670D;&#x52A1;&#x5668;&#xFF1B;</li>
<li>&#x5982;&#x679C;&#x60F3;&#x5F04;&#x4E0A;&#x9632;&#x706B;&#x5899;&#x670D;&#x52A1;&#xFF0C;&#x90A3;&#x4E48;&#x901A;&#x8FC7; <code>iptables</code> &#x5DE5;&#x5177;&#x914D;&#x7F6E; <code>netfilter</code> &#x5C31;&#x53EF;&#x4EE5;</li>
</ul>
<p>What&apos;s more&#xFF1F;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x60F3;&#x5230;&#xFF0C;Linux&#x4E0A;&#x57FA;&#x672C;&#x90FD;&#x6709;&#x76F8;&#x5E94;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
<p><span id="toc_5782_1744_12"></span></p>
<h3 id="linux-&#x4E0B;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x8BCA;&#x65AD;&#x4E0E;&#x7EF4;&#x62A4;">Linux &#x4E0B;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x8BCA;&#x65AD;&#x4E0E;&#x7EF4;&#x62A4;</h3>
<p>&#x5982;&#x679C;&#x51FA;&#x73B0;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x8981;&#x60CA;&#x614C;&#xFF0C;&#x9010;&#x6B65;&#x68C0;&#x67E5;&#x7F51;&#x7EDC;&#x7684;&#x5404;&#x4E2A;&#x5C42;&#x6B21;&#xFF1A;&#x7269;&#x7406;&#x94FE;&#x63A5;&#x3001;&#x94FE;&#x8DEF;&#x5C42;&#x3001;&#x7F51;&#x7EDC;&#x5C42;&#x76F4;&#x5230;&#x5E94;&#x7528;&#x5C42;&#xFF0C;&#x719F;&#x6089;&#x4F7F;&#x7528;&#x5404;&#x79CD;&#x5982;&#x4E0B;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5305;&#x62EC; <code>ethereal/tcpdump</code>&#xFF0C;<code>hping</code>&#xFF0C;<code>nmap</code>&#xFF0C;<code>netstat</code>&#xFF0C;<code>netpipe</code>&#xFF0C;<code>netperf</code>&#xFF0C;<code>vnstat</code>&#xFF0C;<code>ntop</code> &#x7B49;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x7684;&#x8BE6;&#x7EC6;&#x7528;&#x6CD5;&#x548C;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x8BCA;&#x65AD;&#x548C;&#x7EF4;&#x62A4;&#x7684;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#xFF0C;&#x8BF7;&#x770B;&#x540E;&#x7EED;&#x76F8;&#x5173;&#x8D44;&#x6599;&#x3002;</p>
<p><span id="toc_5782_1744_13"></span></p>
<h2 id="linux-&#x4E0B;&#x7F51;&#x7EDC;&#x7F16;&#x7A0B;&#x4E0E;&#x5F00;&#x53D1;">Linux &#x4E0B;&#x7F51;&#x7EDC;&#x7F16;&#x7A0B;&#x4E0E;&#x5F00;&#x53D1;</h2>
<p>&#x5982;&#x679C;&#x60F3;&#x505A;&#x7F51;&#x7EDC;&#x7F16;&#x7A0B;&#x5F00;&#x53D1;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x8981;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF; <code>/</code> &#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x91C7;&#x7528; Linux &#x4E0B;&#x7684; <code>socket</code> &#x7F16;&#x7A0B;&#x4E86;&#xFF1B;</li>
<li>&#x5982;&#x679C;&#x60F3;&#x5199;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5305;&#x6293;&#x83B7;&#x548C;&#x534F;&#x8BAE;&#x5206;&#x6790;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x53EF;&#x4EE5;&#x91C7;&#x7528; <code>libpap</code> &#x7B49;&#x51FD;&#x6570;&#x5E93;&#xFF1B;</li>
<li>&#x5982;&#x679C;&#x60F3;&#x5B9E;&#x73B0;&#x67D0;&#x4E2A;&#x534F;&#x8BAE;&#x5462;&#xFF0C;&#x90A3;&#x5C31;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x76F8;&#x5173;&#x7684; <code>RFC</code> &#x6587;&#x6863;&#xFF0C;&#x5E76;&#x901A;&#x8FC7; <code>socket</code> &#x7F16;&#x7A0B;&#x6765;&#x5B9E;&#x73B0;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x76F8;&#x5173;&#x7684; <code>Linux socket</code> &#x7F16;&#x7A0B;&#x7B49;&#x8D44;&#x6599;&#x3002;</p>
<p><span id="toc_5782_1744_14"></span></p>
<h2 id="&#x540E;&#x8BB0;">&#x540E;&#x8BB0;</h2>
<p>&#x672C;&#x6765;&#x4ECB;&#x7ECD;&#x7F51;&#x7EDC;&#x76F8;&#x5173;&#x7684;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x5185;&#x5BB9;&#xFF0C;&#x4F46;&#x56E0;&#x65F6;&#x95F4;&#x5173;&#x7CFB;&#xFF0C;&#x6CA1;&#x6709;&#x8BE6;&#x8FF0;&#xFF0C;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#x8BF7;&#x53C2;&#x8003;&#x76F8;&#x5173;&#x8D44;&#x6599;&#x3002;</p>
<p>&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6574;&#x4E2A;&#x300A;Shell&#x7F16;&#x7A0B;&#x8303;&#x4F8B;&#x300B;&#x7B97;&#x662F;&#x5F88;&#x7C97;&#x7565;&#x5730;&#x5B8C;&#x6210;&#x4E86;&#xFF0C;&#x4E0D;&#x8FC7;&#x201C;&#x8303;&#x4F8B;&#x201D;&#x5374;&#x7F3A;&#x5C11;&#x5B9E;&#x4F8B;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x8FD9;&#x4E00;&#x8282;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x65F6;&#x95F4;&#x5141;&#x8BB8;&#xFF0C;&#x4F1A;&#x9010;&#x6B65;&#x8865;&#x5145;&#x4E00;&#x4E9B;&#x5B9E;&#x4F8B;&#x3002;</p>
<p><span id="toc_5782_1744_15"></span></p>
<h2 id="&#x53C2;&#x8003;&#x8D44;&#x6599;">&#x53C2;&#x8003;&#x8D44;&#x6599;</h2>
<ul>
<li>&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x2014;&#x2014;&#x81EA;&#x4E0A;&#x800C;&#x4E0B;&#x7684;&#x5206;&#x6790;&#x65B9;&#x6CD5;</li>
<li>Linux &#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF08;&#x6E05;&#x534E;&#x5927;&#x5B66;&#x51FA;&#x7248;&#x793E;&#x51FA;&#x7248;&#xFF09;</li>
<li>Linux &#x7CFB;&#x7EDF;&#x6545;&#x969C;&#x8BCA;&#x65AD;&#x4E0E;&#x6392;&#x9664; &#x7B2C;13&#x7AE0; &#x7F51;&#x7EDC;&#x95EE;&#x9898;&#xFF08;&#x4EBA;&#x6C11;&#x90AE;&#x7535;&#x51FA;&#x7248;&#x793E;&#xFF09;</li>
<li>&#x5728; Linux &#x4E0B;&#x7528; ADSL &#x62E8;&#x53F7;&#x4E0A;&#x7F51;</li>
<li>Linux &#x4E0B;&#x65E0;&#x7EBF;&#x7F51;&#x7EDC;&#x76F8;&#x5173;&#x8D44;&#x6599;&#x6536;&#x96C6;</li>
<li><a href="http://www.ibm.com/developerworks/cn/linux/kernel/l-netbr/index.html" target="_blank">Linux&#x7F51;&#x6865;&#x7684;&#x5B9E;&#x73B0;&#x5206;&#x6790;&#x4E0E;&#x4F7F;&#x7528;</a></li>
<li><a href="http://tldp.org/HOWTO/DHCP/" target="_blank">DHCP mini howto</a></li>
<li>&#x6700;&#x4F73;&#x7684; 75 &#x4E2A;&#x5B89;&#x5168;&#x5DE5;&#x5177;</li>
<li>&#x7F51;&#x7EDC;&#x7BA1;&#x7406;&#x5458;&#x5FC5;&#x987B;&#x638C;&#x63E1;&#x7684;&#x77E5;&#x8BC6;</li>
<li>Linux &#x4E0A;&#x68C0;&#x6D4B; rootkit &#x7684;&#x4E24;&#x79CD;&#x5DE5;&#x5177;: Rootkit Hunter &#x548C; Chkrootkit</li>
<li>&#x6570;&#x636E;&#x5305;&#x6293;&#x83B7;&#x4E0E; ip &#x534F;&#x8BAE;&#x7684;&#x7B80;&#x5355;&#x5206;&#x6790;&#xFF08;&#x57FA;&#x4E8E; pcap &#x5E93;&#xFF09;</li>
<li><a href="http://www.ietf.org/rfc" target="_blank">RFC</a></li>
<li><a href="http://zhoulifa.bokee.com/4640913.html" target="_blank">HTTP &#x534F;&#x8BAE;&#x7684; C &#x8BED;&#x8A00;&#x7F16;&#x7A0B;&#x5B9E;&#x73B0;&#x5B9E;&#x4F8B;</a></li>
</ul>

                                
                                </section>
                            
                        </div>
                    </div>
                
            </div>

            
                
                <a href="01-chapter7.html" class="navigation navigation-prev " aria-label="Previous page: 进程操作">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="01-chapter9.html" class="navigation navigation-next " aria-label="Next page: 总结">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"网络操作","level":"1.11","depth":1,"next":{"title":"总结","level":"1.12","depth":1,"path":"zh/chapters/01-chapter9.markdown","ref":"zh/chapters/01-chapter9.markdown","articles":[]},"previous":{"title":"进程操作","level":"1.10","depth":1,"path":"zh/chapters/01-chapter7.markdown","ref":"zh/chapters/01-chapter7.markdown","articles":[]},"dir":"ltr"},"config":{"plugins":["-search","-sharing","-livereload","-fontsettings","baidu","sitemap","disqus"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"baidu":{"token":"7d789811683659f2ce2723c13b6f88ef"},"sitemap":{"hostname":"http://selenium.tester360.cn/"},"disqus":{"useIdentifier":false,"shortName":"wwwtester360cn"},"highlight":{},"lunr":{"maxIndexSize":1000000},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Shell 编程范例","language":["zh-cn","en"],"links":{"sidebar":{"首页":"http://www.tester360.cn"}},"gitbook":"*","description":"Shell编程学习入门教程"},"file":{"path":"zh/chapters/01-chapter8.markdown","mtime":"2016-06-20T01:40:33.578Z","type":"markdown"},"gitbook":{"version":"3.1.1","time":"2016-06-20T02:43:04.141Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-baidu/plugin.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    

    </body>
</html>

